#### Terraform Plan 📖
<details><summary>Show Plan</summary>

```terraform
[command]/home/runner/work/_temp/f8b51de6-eb0e-4b83-b728-b28dbc66beae/terraform-bin plan -out=tfplan -no-color
module.ecr.aws_ecr_repository_policy.this[0]: Refreshing state... [id=aidoctors-app]
module.s3_alb_logs.data.aws_partition.current: Reading...
module.ecr.aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=aidoctors-app]
module.ecr_pipeline.data.aws_partition.current: Reading...
aws_iam_role.ecs_task_role: Refreshing state... [id=aidoctors-ecs-task-role]
aws_cloudwatch_log_group.ecs: Refreshing state... [id=/ecs/aidoctors]
module.ecr.aws_ecr_repository.this[0]: Refreshing state... [id=aidoctors-app]
module.ecr_pipeline.data.aws_partition.current: Read complete after 0s [id=aws]
module.s3_alb_logs.data.aws_partition.current: Read complete after 0s [id=aws]
module.s3_alb_logs.aws_s3_bucket.this[0]: Refreshing state... [id=aidoctors-alb-logs]
module.s3_alb_logs.data.aws_region.current: Reading...
module.s3_alb_logs.data.aws_caller_identity.current: Reading...
module.s3_alb_logs.data.aws_region.current: Read complete after 0s [id=us-east-2]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-05686e7dc52f8f6df]
module.ecs_cluster.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/ecs/aidoctors-cluster]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=aidoctors-ecs-task-execution-role]
module.s3_alb_logs.data.aws_caller_identity.current: Read complete after 0s [id=521538197756]
module.ecr_app.data.aws_caller_identity.current: Reading...
module.ecr_app.data.aws_caller_identity.current: Read complete after 0s [id=521538197756]
module.route53_zone.aws_route53_zone.this["aidoctors.com"]: Refreshing state... [id=Z07552261L3Y3JSSNSTHB]
module.ecr_pipeline.data.aws_caller_identity.current: Reading...
module.ecr_app.data.aws_partition.current: Reading...
module.ecr_app.data.aws_partition.current: Read complete after 0s [id=aws]
aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=aidoctors-ecs-task-execution-role/arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]
aws_iam_role_policy.ecs_task_execution_ecr_policy: Refreshing state... [id=aidoctors-ecs-task-execution-role:aidoctors-ecs-task-execution-ecr-policy]
module.ecr_app.data.aws_iam_policy_document.repository[0]: Reading...
module.ecs_cluster.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-2:521538197756:cluster/aidoctors-cluster]
module.ecr_app.data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=1578471098]
module.ecr_pipeline.data.aws_caller_identity.current: Read complete after 0s [id=521538197756]
module.ecr_pipeline.data.aws_iam_policy_document.repository[0]: Reading...
module.ecr_pipeline.data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=1578471098]
aws_iam_role_policy.ecs_task_role_policy: Refreshing state... [id=aidoctors-ecs-task-role:aidoctors-ecs-task-role-policy]
aws_ecs_task_definition.app: Refreshing state... [id=aidoctors-app]
module.ecs_cluster.aws_ecs_cluster_capacity_providers.this[0]: Refreshing state... [id=aidoctors-cluster]
module.s3_alb_logs.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=aidoctors-alb-logs]
module.s3_alb_logs.data.aws_iam_policy_document.lb_log_delivery[0]: Reading...
module.s3_alb_logs.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=aidoctors-alb-logs]
module.s3_alb_logs.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=aidoctors-alb-logs]
module.s3_alb_logs.data.aws_iam_policy_document.lb_log_delivery[0]: Read complete after 0s [id=1261215049]
module.s3_alb_logs.data.aws_iam_policy_document.elb_log_delivery[0]: Reading...
module.s3_alb_logs.data.aws_iam_policy_document.elb_log_delivery[0]: Read complete after 0s [id=2281510643]
module.s3_alb_logs.data.aws_iam_policy_document.combined[0]: Reading...
module.s3_alb_logs.data.aws_iam_policy_document.combined[0]: Read complete after 0s [id=2642795832]
module.s3_alb_logs.aws_s3_bucket_policy.this[0]: Refreshing state... [id=aidoctors-alb-logs]
module.s3_alb_logs.aws_s3_bucket_ownership_controls.this[0]: Refreshing state... [id=aidoctors-alb-logs]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0fc63c4d494374dd6]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-083c0db3e1395fded]
module.rds_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-03ed752e073dfbab3]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0f5eb680acf65fea3]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-09431dd1309dfe33a]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0bf70d3f2fadcfb41]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0f7d82a180ace47f4]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-07bf335ed55e1233f]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0032386130964171e]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-07efa2bcb551685bd]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-00181454359ad7fee]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-073019d7ba4d1ac80]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0c5b5757a4ad55762]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-043f4c0120570ae34]
module.rds_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3263409970]
module.rds_security_group.aws_security_group_rule.egress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3542370404]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=aidoctors-vpc]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-061c36c6e2b02f39c]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-073ba5a5e32dc7574]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-030857cf79d386198]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-038f6ff47eba184f5]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0f7d82a180ace47f41080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0bbaf291468d476f3]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08ce7f62a5a36df2c]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0c43d4e8b4f48b114]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-060bb021411c4af84]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-060795adfd71d2087]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0e24a561bd9bff913]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0f5eb680acf65fea31080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-09431dd1309dfe33a1080289494]
module.db.module.db_instance.random_id.snapshot_identifier[0]: Refreshing state... [id=3ECwjw]
module.db.module.db_instance.aws_cloudwatch_log_group.this["postgresql"]: Refreshing state... [id=/aws/rds/instance/aidoctors-db/postgresql]
module.db.module.db_instance.aws_iam_role.enhanced_monitoring[0]: Refreshing state... [id=aidoctors-rds-monitoring-role]
module.db.module.db_instance.aws_cloudwatch_log_group.this["upgrade"]: Refreshing state... [id=/aws/rds/instance/aidoctors-db/upgrade]
module.db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=aidoctors-db-20251029162216762800000001]
module.alb.aws_security_group.this[0]: Refreshing state... [id=sg-09a7c57f478f193d7]
module.alb.aws_lb_target_group.this["aidoctors-application"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:521538197756:targetgroup/aid20251029181402051700000002/4dbbca979682b739]
module.alb.aws_vpc_security_group_ingress_rule.this["all_http"]: Refreshing state... [id=sgr-0be5005f96f1578a8]
module.alb.aws_vpc_security_group_egress_rule.this["all"]: Refreshing state... [id=sgr-0b0fee6925a741f5d]
module.alb.aws_vpc_security_group_ingress_rule.this["all_https"]: Refreshing state... [id=sgr-01ef6dce0fbb665e9]
aws_security_group.ecs_tasks: Refreshing state... [id=sg-058d551c3513cd7d4]
module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:521538197756:loadbalancer/app/aidoctors-alb/6652fc2ac194375a]
module.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0]: Refreshing state... [id=aidoctors-rds-monitoring-role/arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole]
module.db.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=db-YUAZASCKMEEFMFFXGN37R4GCT4]
module.s3_alb_logs.aws_s3_bucket_lifecycle_configuration.this[0]: Refreshing state... [id=aidoctors-alb-logs]
module.db.module.db_instance.aws_secretsmanager_secret_rotation.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:521538197756:secret:rds!db-cbfeed5f-8f40-443b-9729-9c3f489f3b09-uO760T]
module.alb.aws_lb_listener.this["ex-http"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:521538197756:listener/app/aidoctors-alb/6652fc2ac194375a/65282dea93f7061c]
aws_route53_record.root: Refreshing state... [id=Z07552261L3Y3JSSNSTHB_aidoctors.com_A]
aws_ecs_service.app: Refreshing state... [id=arn:aws:ecs:us-east-2:521538197756:service/aidoctors-cluster/aidoctors-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.ecs will be destroyed
  # (because aws_cloudwatch_log_group.ecs is not in configuration)
  - resource "aws_cloudwatch_log_group" "ecs" {
      - arn               = "arn:aws:logs:us-east-2:521538197756:log-group:/ecs/aidoctors" -> null
      - id                = "/ecs/aidoctors" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/ecs/aidoctors" -> null
      - region            = "us-east-2" -> null
      - retention_in_days = 7 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "Name" = "aidoctors-ecs-logs"
        } -> null
      - tags_all          = {
          - "Name" = "aidoctors-ecs-logs"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.ecs_app will be created
  + resource "aws_cloudwatch_log_group" "ecs_app" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/aidoctors-app"
      + name_prefix       = (known after apply)
      + region            = "us-east-2"
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Name" = "aidoctors-app-logs"
        }
      + tags_all          = {
          + "Name" = "aidoctors-app-logs"
        }
    }

  # aws_cloudwatch_log_group.ecs_datapipeline will be created
  + resource "aws_cloudwatch_log_group" "ecs_datapipeline" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/aidoctors-datapipeline"
      + name_prefix       = (known after apply)
      + region            = "us-east-2"
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Name" = "aidoctors-datapipeline-logs"
        }
      + tags_all          = {
          + "Name" = "aidoctors-datapipeline-logs"
        }
    }

  # aws_ecs_service.app must be replaced
-/+ resource "aws_ecs_service" "app" {
      ~ arn                                = "arn:aws:ecs:us-east-2:521538197756:service/aidoctors-cluster/aidoctors-service" -> (known after apply)
      ~ availability_zone_rebalancing      = "ENABLED" -> (known after apply)
      - health_check_grace_period_seconds  = 0 -> null
      ~ iam_role                           = "/aws-service-role/ecs.amazonaws.com/AWSServiceRoleForECS" -> (known after apply)
      ~ id                                 = "arn:aws:ecs:us-east-2:521538197756:service/aidoctors-cluster/aidoctors-service" -> (known after apply)
      ~ name                               = "aidoctors-service" -> "aidoctors-app-service" # forces replacement
      ~ platform_version                   = "LATEST" -> (known after apply)
      - propagate_tags                     = "NONE" -> null
      ~ tags                               = {
          ~ "Name" = "aidoctors-ecs-service" -> "aidoctors-app-service"
        }
      ~ tags_all                           = {
          ~ "Name" = "aidoctors-ecs-service" -> "aidoctors-app-service"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-2:521538197756:task-definition/aidoctors-app:1" -> (known after apply)
      ~ triggers                           = {} -> (known after apply)
        # (10 unchanged attributes hidden)

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

      ~ deployment_configuration (known after apply)
      - deployment_configuration {
          - bake_time_in_minutes = "0" -> null
          - strategy             = "ROLLING" -> null
        }

      - deployment_controller {
          - type = "ECS" -> null
        }

      - load_balancer {
          - container_name   = "aidoctors-container" -> null
          - container_port   = 80 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:521538197756:targetgroup/aid20251029181402051700000002/4dbbca979682b739" -> null
            # (1 unchanged attribute hidden)
        }
      + load_balancer {
          + container_name   = "aidoctors-app-container"
          + container_port   = 80
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:521538197756:targetgroup/aid20251029181402051700000002/4dbbca979682b739"
            # (1 unchanged attribute hidden)
        }

      ~ network_configuration {
          ~ subnets          = [
              - "subnet-073019d7ba4d1ac80",
              - "subnet-0c5b5757a4ad55762",
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # aws_ecs_service.pipeline will be created
  + resource "aws_ecs_service" "pipeline" {
      + arn                                = (known after apply)
      + availability_zone_rebalancing      = (known after apply)
      + cluster                            = "arn:aws:ecs:us-east-2:521538197756:cluster/aidoctors-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 0
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "aidoctors-pipeline-service"
      + platform_version                   = (known after apply)
      + region                             = "us-east-2"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Name" = "aidoctors-pipeline-service"
        }
      + tags_all                           = {
          + "Name" = "aidoctors-pipeline-service"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_configuration (known after apply)

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-058d551c3513cd7d4",
            ]
          + subnets          = (known after apply)
        }
    }

  # aws_ecs_task_definition.app must be replaced
-/+ resource "aws_ecs_task_definition" "app" {
      ~ arn                      = "arn:aws:ecs:us-east-2:521538197756:task-definition/aidoctors-app:1" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:521538197756:task-definition/aidoctors-app" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - environment      = []
                  - essential        = true
                  - image            = "521538197756.dkr.ecr.us-east-2.amazonaws.com/aidoctors-app:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/ecs/aidoctors"
                          - awslogs-region        = "us-east-2"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - mountPoints      = []
                  - name             = "aidoctors-container"
                  - portMappings     = [
                      - {
                          - containerPort = 80
                          - hostPort      = 80
                          - protocol      = "tcp"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "aidoctors-app" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
      ~ tags                     = {
          ~ "Name" = "aidoctors-task-definition" -> "aidoctors-app-task-definition"
        }
      ~ tags_all                 = {
          ~ "Name" = "aidoctors-task-definition" -> "aidoctors-app-task-definition"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_ecs_task_definition.pipeline will be created
  + resource "aws_ecs_task_definition" "pipeline" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "512"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = "arn:aws:iam::521538197756:role/aidoctors-ecs-task-execution-role"
      + family                   = "aidoctors-pipeline"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + region                   = "us-east-2"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Name" = "aidoctors-pipeline-task-definition"
        }
      + tags_all                 = {
          + "Name" = "aidoctors-pipeline-task-definition"
        }
      + task_role_arn            = "arn:aws:iam::521538197756:role/aidoctors-ecs-task-role"
      + track_latest             = false
    }

  # module.alb.data.aws_partition.current[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.alb.aws_lb.this[0] will be updated in-place
  ~ resource "aws_lb" "this" {
        id                                                           = "arn:aws:elasticloadbalancing:us-east-2:521538197756:loadbalancer/app/aidoctors-alb/6652fc2ac194375a"
        name                                                         = "aidoctors-alb"
      ~ subnets                                                      = [
          - "subnet-00181454359ad7fee",
          - "subnet-07bf335ed55e1233f",
        ] -> (known after apply)
        tags                                                         = {
            "Name"                  = "aidoctors-alb"
            "terraform-aws-modules" = "alb"
        }
        # (27 unchanged attributes hidden)

      ~ subnet_mapping (known after apply)
      - subnet_mapping {
          - subnet_id            = "subnet-00181454359ad7fee" -> null
            # (4 unchanged attributes hidden)
        }
      - subnet_mapping {
          - subnet_id            = "subnet-07bf335ed55e1233f" -> null
            # (4 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.ecr.aws_ecr_lifecycle_policy.this[0] will be destroyed
  # (because aws_ecr_lifecycle_policy.this is not in configuration)
  - resource "aws_ecr_lifecycle_policy" "this" {
      - id          = "aidoctors-app" -> null
      - policy      = jsonencode(
            {
              - rules = [
                  - {
                      - action       = {
                          - type = "expire"
                        }
                      - description  = "Keep last 5 images"
                      - rulePriority = 1
                      - selection    = {
                          - countNumber   = 5
                          - countType     = "imageCountMoreThan"
                          - tagPrefixList = [
                              - "v",
                            ]
                          - tagStatus     = "tagged"
                        }
                    },
                  - {
                      - action       = {
                          - type = "expire"
                        }
                      - description  = "Remove untagged images after 7 days"
                      - rulePriority = 2
                      - selection    = {
                          - countNumber = 7
                          - countType   = "sinceImagePushed"
                          - countUnit   = "days"
                          - tagStatus   = "untagged"
                        }
                    },
                ]
            }
        ) -> null
      - region      = "us-east-2" -> null
      - registry_id = "521538197756" -> null
      - repository  = "aidoctors-app" -> null
    }

  # module.ecr.aws_ecr_repository.this[0] will be destroyed
  # (because aws_ecr_repository.this is not in configuration)
  - resource "aws_ecr_repository" "this" {
      - arn                  = "arn:aws:ecr:us-east-2:521538197756:repository/aidoctors-app" -> null
      - force_delete         = true -> null
      - id                   = "aidoctors-app" -> null
      - image_tag_mutability = "IMMUTABLE" -> null
      - name                 = "aidoctors-app" -> null
      - region               = "us-east-2" -> null
      - registry_id          = "521538197756" -> null
      - repository_url       = "521538197756.dkr.ecr.us-east-2.amazonaws.com/aidoctors-app" -> null
      - tags                 = {
          - "Name" = "aidoctors-ecr"
        } -> null
      - tags_all             = {
          - "Name" = "aidoctors-ecr"
        } -> null

      - encryption_configuration {
          - encryption_type = "AES256" -> null
            # (1 unchanged attribute hidden)
        }

      - image_scanning_configuration {
          - scan_on_push = true -> null
        }
    }

  # module.ecr.aws_ecr_repository_policy.this[0] will be destroyed
  # (because aws_ecr_repository_policy.this is not in configuration)
  - resource "aws_ecr_repository_policy" "this" {
      - id          = "aidoctors-app" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "ecr:ListTagsForResource",
                          - "ecr:ListImages",
                          - "ecr:GetRepositoryPolicy",
                          - "ecr:GetLifecyclePolicyPreview",
                          - "ecr:GetLifecyclePolicy",
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:DescribeRepositories",
                          - "ecr:DescribeImages",
                          - "ecr:DescribeImageScanFindings",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::521538197756:root"
                        }
                      - Sid       = "PrivateReadOnly"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - region      = "us-east-2" -> null
      - registry_id = "521538197756" -> null
      - repository  = "aidoctors-app" -> null
    }

  # module.ecr_app.aws_ecr_lifecycle_policy.this[0] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 5 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 5
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Remove untagged images after 7 days"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber = 7
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + region      = "us-east-2"
      + registry_id = (known after apply)
      + repository  = "aidoctors-app"
    }

  # module.ecr_app.aws_ecr_repository.this[0] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "aidoctors-app"
      + region               = "us-east-2"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name" = "aidoctors-app-ecr"
        }
      + tags_all             = {
          + "Name" = "aidoctors-app-ecr"
        }

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr_app.aws_ecr_repository_policy.this[0] will be created
  + resource "aws_ecr_repository_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:ListTagsForResource",
                          + "ecr:ListImages",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:GetLifecyclePolicyPreview",
                          + "ecr:GetLifecyclePolicy",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:DescribeRepositories",
                          + "ecr:DescribeImages",
                          + "ecr:DescribeImageScanFindings",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::521538197756:root"
                        }
                      + Sid       = "PrivateReadOnly"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region      = "us-east-2"
      + registry_id = (known after apply)
      + repository  = "aidoctors-app"
    }

  # module.ecr_pipeline.aws_ecr_lifecycle_policy.this[0] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 5 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 5
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Remove untagged images after 7 days"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber = 7
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + region      = "us-east-2"
      + registry_id = (known after apply)
      + repository  = "aidoctors-pipeline"
    }

  # module.ecr_pipeline.aws_ecr_repository.this[0] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "aidoctors-pipeline"
      + region               = "us-east-2"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name" = "aidoctors-pipeline-ecr"
        }
      + tags_all             = {
          + "Name" = "aidoctors-pipeline-ecr"
        }

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr_pipeline.aws_ecr_repository_policy.this[0] will be created
  + resource "aws_ecr_repository_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:ListTagsForResource",
                          + "ecr:ListImages",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:GetLifecyclePolicyPreview",
                          + "ecr:GetLifecyclePolicy",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:DescribeRepositories",
                          + "ecr:DescribeImages",
                          + "ecr:DescribeImageScanFindings",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::521538197756:root"
                        }
                      + Sid       = "PrivateReadOnly"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region      = "us-east-2"
      + registry_id = (known after apply)
      + repository  = "aidoctors-pipeline"
    }

  # module.vpc.aws_nat_gateway.this[1] must be replaced
+/- resource "aws_nat_gateway" "this" {
      ~ association_id                     = "eipassoc-03c8f3b28f269f523" -> (known after apply)
      ~ id                                 = "nat-060795adfd71d2087" -> (known after apply)
      ~ network_interface_id               = "eni-0dbd126d96cce631f" -> (known after apply)
      ~ private_ip                         = "10.0.4.145" -> (known after apply)
      ~ public_ip                          = "3.147.233.242" -> (known after apply)
      ~ secondary_allocation_ids           = [] -> (known after apply)
      ~ secondary_private_ip_address_count = 0 -> (known after apply)
      ~ secondary_private_ip_addresses     = [] -> (known after apply)
      ~ subnet_id                          = "subnet-00181454359ad7fee" -> (known after apply) # forces replacement
        tags                               = {
            "Name" = "aidoctors-vpc"
        }
        # (4 unchanged attributes hidden)
    }

  # module.vpc.aws_route.private_nat_gateway[1] will be updated in-place
  ~ resource "aws_route" "private_nat_gateway" {
        id                          = "r-rtb-09431dd1309dfe33a1080289494"
      ~ nat_gateway_id              = "nat-060795adfd71d2087" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_route_table_association.private[1] must be replaced
+/- resource "aws_route_table_association" "private" {
      ~ id             = "rtbassoc-060bb021411c4af84" -> (known after apply)
      ~ subnet_id      = "subnet-0c5b5757a4ad55762" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table_association.public[1] must be replaced
+/- resource "aws_route_table_association" "public" {
      ~ id             = "rtbassoc-08ce7f62a5a36df2c" -> (known after apply)
      ~ subnet_id      = "subnet-00181454359ad7fee" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[1] must be replaced
+/- resource "aws_subnet" "private" {
      ~ arn                                            = "arn:aws:ec2:us-east-2:521538197756:subnet/subnet-0c5b5757a4ad55762" -> (known after apply)
      ~ availability_zone_id                           = "use2-az2" -> (known after apply)
      ~ cidr_block                                     = "10.0.5.0/24" -> "10.0.4.0/24" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-0c5b5757a4ad55762" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "521538197756" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "aidoctors-vpc"
        }
        # (13 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[1] must be replaced
+/- resource "aws_subnet" "public" {
      ~ arn                                            = "arn:aws:ec2:us-east-2:521538197756:subnet/subnet-00181454359ad7fee" -> (known after apply)
      ~ availability_zone_id                           = "use2-az2" -> (known after apply)
      ~ cidr_block                                     = "10.0.4.0/24" -> "10.0.5.0/24" # forces replacement
      - enable_lni_at_device_index                     = 0 -> null
      ~ id                                             = "subnet-00181454359ad7fee" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "521538197756" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "aidoctors-vpc"
        }
        # (13 unchanged attributes hidden)
    }

  # module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "enhanced_monitoring" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]

          + principals {
              + identifiers = [
                  + "monitoring.rds.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.db.module.db_instance.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.db.module.db_instance.aws_iam_role.enhanced_monitoring[0] will be updated in-place
  ~ resource "aws_iam_role" "enhanced_monitoring" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "monitoring.rds.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "aidoctors-rds-monitoring-role"
        name                  = "aidoctors-rds-monitoring-role"
        tags                  = {
            "Name" = "aidoctors-postgres"
        }
        # (11 unchanged attributes hidden)
    }

  # module.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "enhanced_monitoring" {
      ~ id         = "aidoctors-rds-monitoring-role/arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 18 to add, 3 to change, 12 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
::debug::Terraform exited with code 0.
::debug::stdout: module.ecr.aws_ecr_repository_policy.this[0]: Refreshing state... [id=aidoctors-app]%0Amodule.s3_alb_logs.data.aws_partition.current: Reading...%0Amodule.ecr.aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=aidoctors-app]%0Amodule.ecr_pipeline.data.aws_partition.current: Reading...%0Aaws_iam_role.ecs_task_role: Refreshing state... [id=aidoctors-ecs-task-role]%0Aaws_cloudwatch_log_group.ecs: Refreshing state... [id=/ecs/aidoctors]%0Amodule.ecr.aws_ecr_repository.this[0]: Refreshing state... [id=aidoctors-app]%0Amodule.ecr_pipeline.data.aws_partition.current: Read complete after 0s [id=aws]%0Amodule.s3_alb_logs.data.aws_partition.current: Read complete after 0s [id=aws]%0Amodule.s3_alb_logs.aws_s3_bucket.this[0]: Refreshing state... [id=aidoctors-alb-logs]%0Amodule.s3_alb_logs.data.aws_region.current: Reading...%0Amodule.s3_alb_logs.data.aws_caller_identity.current: Reading...%0Amodule.s3_alb_logs.data.aws_region.current: Read complete after 0s [id=us-east-2]%0Amodule.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-05686e7dc52f8f6df]%0Amodule.ecs_cluster.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/ecs/aidoctors-cluster]%0Aaws_iam_role.ecs_task_execution_role: Refreshing state... [id=aidoctors-ecs-task-execution-role]%0Amodule.s3_alb_logs.data.aws_caller_identity.current: Read complete after 0s [id=521538197756]%0Amodule.ecr_app.data.aws_caller_identity.current: Reading...%0Amodule.ecr_app.data.aws_caller_identity.current: Read complete after 0s [id=521538197756]%0Amodule.route53_zone.aws_route53_zone.this["aidoctors.com"]: Refreshing state... [id=Z07552261L3Y3JSSNSTHB]%0Amodule.ecr_pipeline.data.aws_caller_identity.current: Reading...%0Amodule.ecr_app.data.aws_partition.current: Reading...%0Amodule.ecr_app.data.aws_partition.current: Read complete after 0s [id=aws]%0Aaws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=aidoctors-ecs-task-execution-role/arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]%0Aaws_iam_role_policy.ecs_task_execution_ecr_policy: Refreshing state... [id=aidoctors-ecs-task-execution-role:aidoctors-ecs-task-execution-ecr-policy]%0Amodule.ecr_app.data.aws_iam_policy_document.repository[0]: Reading...%0Amodule.ecs_cluster.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-2:521538197756:cluster/aidoctors-cluster]%0Amodule.ecr_app.data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=1578471098]%0Amodule.ecr_pipeline.data.aws_caller_identity.current: Read complete after 0s [id=521538197756]%0Amodule.ecr_pipeline.data.aws_iam_policy_document.repository[0]: Reading...%0Amodule.ecr_pipeline.data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=1578471098]%0Aaws_iam_role_policy.ecs_task_role_policy: Refreshing state... [id=aidoctors-ecs-task-role:aidoctors-ecs-task-role-policy]%0Aaws_ecs_task_definition.app: Refreshing state... [id=aidoctors-app]%0Amodule.ecs_cluster.aws_ecs_cluster_capacity_providers.this[0]: Refreshing state... [id=aidoctors-cluster]%0Amodule.s3_alb_logs.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=aidoctors-alb-logs]%0Amodule.s3_alb_logs.data.aws_iam_policy_document.lb_log_delivery[0]: Reading...%0Amodule.s3_alb_logs.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=aidoctors-alb-logs]%0Amodule.s3_alb_logs.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=aidoctors-alb-logs]%0Amodule.s3_alb_logs.data.aws_iam_policy_document.lb_log_delivery[0]: Read complete after 0s [id=1261215049]%0Amodule.s3_alb_logs.data.aws_iam_policy_document.elb_log_delivery[0]: Reading...%0Amodule.s3_alb_logs.data.aws_iam_policy_document.elb_log_delivery[0]: Read complete after 0s [id=2281510643]%0Amodule.s3_alb_logs.data.aws_iam_policy_document.combined[0]: Reading...%0Amodule.s3_alb_logs.data.aws_iam_policy_document.combined[0]: Read complete after 0s [id=2642795832]%0Amodule.s3_alb_logs.aws_s3_bucket_policy.this[0]: Refreshing state... [id=aidoctors-alb-logs]%0Amodule.s3_alb_logs.aws_s3_bucket_ownership_controls.this[0]: Refreshing state... [id=aidoctors-alb-logs]%0Amodule.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0fc63c4d494374dd6]%0Amodule.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-083c0db3e1395fded]%0Amodule.rds_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-03ed752e073dfbab3]%0Amodule.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0f5eb680acf65fea3]%0Amodule.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-09431dd1309dfe33a]%0Amodule.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0bf70d3f2fadcfb41]%0Amodule.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0f7d82a180ace47f4]%0Amodule.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-07bf335ed55e1233f]%0Amodule.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0032386130964171e]%0Amodule.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-07efa2bcb551685bd]%0Amodule.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-00181454359ad7fee]%0Amodule.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-073019d7ba4d1ac80]%0Amodule.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0c5b5757a4ad55762]%0Amodule.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-043f4c0120570ae34]%0Amodule.rds_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3263409970]%0Amodule.rds_security_group.aws_security_group_rule.egress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3542370404]%0Amodule.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=aidoctors-vpc]%0Amodule.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-061c36c6e2b02f39c]%0Amodule.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-073ba5a5e32dc7574]%0Amodule.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-030857cf79d386198]%0Amodule.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-038f6ff47eba184f5]%0Amodule.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0f7d82a180ace47f41080289494]%0Amodule.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0bbaf291468d476f3]%0Amodule.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08ce7f62a5a36df2c]%0Amodule.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0c43d4e8b4f48b114]%0Amodule.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-060bb021411c4af84]%0Amodule.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-060795adfd71d2087]%0Amodule.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0e24a561bd9bff913]%0Amodule.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0f5eb680acf65fea31080289494]%0Amodule.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-09431dd1309dfe33a1080289494]%0Amodule.db.module.db_instance.random_id.snapshot_identifier[0]: Refreshing state... [id=3ECwjw]%0Amodule.db.module.db_instance.aws_cloudwatch_log_group.this["postgresql"]: Refreshing state... [id=/aws/rds/instance/aidoctors-db/postgresql]%0Amodule.db.module.db_instance.aws_iam_role.enhanced_monitoring[0]: Refreshing state... [id=aidoctors-rds-monitoring-role]%0Amodule.db.module.db_instance.aws_cloudwatch_log_group.this["upgrade"]: Refreshing state... [id=/aws/rds/instance/aidoctors-db/upgrade]%0Amodule.db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=aidoctors-db-20251029162216762800000001]%0Amodule.alb.aws_security_group.this[0]: Refreshing state... [id=sg-09a7c57f478f193d7]%0Amodule.alb.aws_lb_target_group.this["aidoctors-application"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:521538197756:targetgroup/aid20251029181402051700000002/4dbbca979682b739]%0Amodule.alb.aws_vpc_security_group_ingress_rule.this["all_http"]: Refreshing state... [id=sgr-0be5005f96f1578a8]%0Amodule.alb.aws_vpc_security_group_egress_rule.this["all"]: Refreshing state... [id=sgr-0b0fee6925a741f5d]%0Amodule.alb.aws_vpc_security_group_ingress_rule.this["all_https"]: Refreshing state... [id=sgr-01ef6dce0fbb665e9]%0Aaws_security_group.ecs_tasks: Refreshing state... [id=sg-058d551c3513cd7d4]%0Amodule.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:521538197756:loadbalancer/app/aidoctors-alb/6652fc2ac194375a]%0Amodule.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0]: Refreshing state... [id=aidoctors-rds-monitoring-role/arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole]%0Amodule.db.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=db-YUAZASCKMEEFMFFXGN37R4GCT4]%0Amodule.s3_alb_logs.aws_s3_bucket_lifecycle_configuration.this[0]: Refreshing state... [id=aidoctors-alb-logs]%0Amodule.db.module.db_instance.aws_secretsmanager_secret_rotation.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:521538197756:secret:rds!db-cbfeed5f-8f40-443b-9729-9c3f489f3b09-uO760T]%0Amodule.alb.aws_lb_listener.this["ex-http"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:521538197756:listener/app/aidoctors-alb/6652fc2ac194375a/65282dea93f7061c]%0Aaws_route53_record.root: Refreshing state... [id=Z07552261L3Y3JSSNSTHB_aidoctors.com_A]%0Aaws_ecs_service.app: Refreshing state... [id=arn:aws:ecs:us-east-2:521538197756:service/aidoctors-cluster/aidoctors-service]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A-/+ destroy and then create replacement%0A+/- create replacement and then destroy%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # aws_cloudwatch_log_group.ecs will be destroyed%0A  # (because aws_cloudwatch_log_group.ecs is not in configuration)%0A  - resource "aws_cloudwatch_log_group" "ecs" {%0A      - arn               = "arn:aws:logs:us-east-2:521538197756:log-group:/ecs/aidoctors" -> null%0A      - id                = "/ecs/aidoctors" -> null%0A      - log_group_class   = "STANDARD" -> null%0A      - name              = "/ecs/aidoctors" -> null%0A      - region            = "us-east-2" -> null%0A      - retention_in_days = 7 -> null%0A      - skip_destroy      = false -> null%0A      - tags              = {%0A          - "Name" = "aidoctors-ecs-logs"%0A        } -> null%0A      - tags_all          = {%0A          - "Name" = "aidoctors-ecs-logs"%0A        } -> null%0A        # (2 unchanged attributes hidden)%0A    }%0A%0A  # aws_cloudwatch_log_group.ecs_app will be created%0A  + resource "aws_cloudwatch_log_group" "ecs_app" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + log_group_class   = (known after apply)%0A      + name              = "/ecs/aidoctors-app"%0A      + name_prefix       = (known after apply)%0A      + region            = "us-east-2"%0A      + retention_in_days = 7%0A      + skip_destroy      = false%0A      + tags              = {%0A          + "Name" = "aidoctors-app-logs"%0A        }%0A      + tags_all          = {%0A          + "Name" = "aidoctors-app-logs"%0A        }%0A    }%0A%0A  # aws_cloudwatch_log_group.ecs_datapipeline will be created%0A  + resource "aws_cloudwatch_log_group" "ecs_datapipeline" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + log_group_class   = (known after apply)%0A      + name              = "/ecs/aidoctors-datapipeline"%0A      + name_prefix       = (known after apply)%0A      + region            = "us-east-2"%0A      + retention_in_days = 7%0A      + skip_destroy      = false%0A      + tags              = {%0A          + "Name" = "aidoctors-datapipeline-logs"%0A        }%0A      + tags_all          = {%0A          + "Name" = "aidoctors-datapipeline-logs"%0A        }%0A    }%0A%0A  # aws_ecs_service.app must be replaced%0A-/+ resource "aws_ecs_service" "app" {%0A      ~ arn                                = "arn:aws:ecs:us-east-2:521538197756:service/aidoctors-cluster/aidoctors-service" -> (known after apply)%0A      ~ availability_zone_rebalancing      = "ENABLED" -> (known after apply)%0A      - health_check_grace_period_seconds  = 0 -> null%0A      ~ iam_role                           = "/aws-service-role/ecs.amazonaws.com/AWSServiceRoleForECS" -> (known after apply)%0A      ~ id                                 = "arn:aws:ecs:us-east-2:521538197756:service/aidoctors-cluster/aidoctors-service" -> (known after apply)%0A      ~ name                               = "aidoctors-service" -> "aidoctors-app-service" # forces replacement%0A      ~ platform_version                   = "LATEST" -> (known after apply)%0A      - propagate_tags                     = "NONE" -> null%0A      ~ tags                               = {%0A          ~ "Name" = "aidoctors-ecs-service" -> "aidoctors-app-service"%0A        }%0A      ~ tags_all                           = {%0A          ~ "Name" = "aidoctors-ecs-service" -> "aidoctors-app-service"%0A        }%0A      ~ task_definition                    = "arn:aws:ecs:us-east-2:521538197756:task-definition/aidoctors-app:1" -> (known after apply)%0A      ~ triggers                           = {} -> (known after apply)%0A        # (10 unchanged attributes hidden)%0A%0A      - deployment_circuit_breaker {%0A          - enable   = false -> null%0A          - rollback = false -> null%0A        }%0A%0A      ~ deployment_configuration (known after apply)%0A      - deployment_configuration {%0A          - bake_time_in_minutes = "0" -> null%0A          - strategy             = "ROLLING" -> null%0A        }%0A%0A      - deployment_controller {%0A          - type = "ECS" -> null%0A        }%0A%0A      - load_balancer {%0A          - container_name   = "aidoctors-container" -> null%0A          - container_port   = 80 -> null%0A          - target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:521538197756:targetgroup/aid20251029181402051700000002/4dbbca979682b739" -> null%0A            # (1 unchanged attribute hidden)%0A        }%0A      + load_balancer {%0A          + container_name   = "aidoctors-app-container"%0A          + container_port   = 80%0A          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:521538197756:targetgroup/aid20251029181402051700000002/4dbbca979682b739"%0A            # (1 unchanged attribute hidden)%0A        }%0A%0A      ~ network_configuration {%0A          ~ subnets          = [%0A              - "subnet-073019d7ba4d1ac80",%0A              - "subnet-0c5b5757a4ad55762",%0A            ] -> (known after apply)%0A            # (2 unchanged attributes hidden)%0A        }%0A    }%0A%0A  # aws_ecs_service.pipeline will be created%0A  + resource "aws_ecs_service" "pipeline" {%0A      + arn                                = (known after apply)%0A      + availability_zone_rebalancing      = (known after apply)%0A      + cluster                            = "arn:aws:ecs:us-east-2:521538197756:cluster/aidoctors-cluster"%0A      + deployment_maximum_percent         = 200%0A      + deployment_minimum_healthy_percent = 100%0A      + desired_count                      = 0%0A      + enable_ecs_managed_tags            = false%0A      + enable_execute_command             = false%0A      + iam_role                           = (known after apply)%0A      + id                                 = (known after apply)%0A      + launch_type                        = "FARGATE"%0A      + name                               = "aidoctors-pipeline-service"%0A      + platform_version                   = (known after apply)%0A      + region                             = "us-east-2"%0A      + scheduling_strategy                = "REPLICA"%0A      + tags                               = {%0A          + "Name" = "aidoctors-pipeline-service"%0A        }%0A      + tags_all                           = {%0A          + "Name" = "aidoctors-pipeline-service"%0A        }%0A      + task_definition                    = (known after apply)%0A      + triggers                           = (known after apply)%0A      + wait_for_steady_state              = false%0A%0A      + deployment_configuration (known after apply)%0A%0A      + network_configuration {%0A          + assign_public_ip = false%0A          + security_groups  = [%0A              + "sg-058d551c3513cd7d4",%0A            ]%0A          + subnets          = (known after apply)%0A        }%0A    }%0A%0A  # aws_ecs_task_definition.app must be replaced%0A-/+ resource "aws_ecs_task_definition" "app" {%0A      ~ arn                      = "arn:aws:ecs:us-east-2:521538197756:task-definition/aidoctors-app:1" -> (known after apply)%0A      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:521538197756:task-definition/aidoctors-app" -> (known after apply)%0A      ~ container_definitions    = jsonencode(%0A            [%0A              - {%0A                  - environment      = []%0A                  - essential        = true%0A                  - image            = "521538197756.dkr.ecr.us-east-2.amazonaws.com/aidoctors-app:latest"%0A                  - logConfiguration = {%0A                      - logDriver = "awslogs"%0A                      - options   = {%0A                          - awslogs-group         = "/ecs/aidoctors"%0A                          - awslogs-region        = "us-east-2"%0A                          - awslogs-stream-prefix = "ecs"%0A                        }%0A                    }%0A                  - mountPoints      = []%0A                  - name             = "aidoctors-container"%0A                  - portMappings     = [%0A                      - {%0A                          - containerPort = 80%0A                          - hostPort      = 80%0A                          - protocol      = "tcp"%0A                        },%0A                    ]%0A                  - systemControls   = []%0A                  - volumesFrom      = []%0A                },%0A            ]%0A        ) -> (known after apply) # forces replacement%0A      ~ enable_fault_injection   = false -> (known after apply)%0A      ~ id                       = "aidoctors-app" -> (known after apply)%0A      ~ revision                 = 1 -> (known after apply)%0A      ~ tags                     = {%0A          ~ "Name" = "aidoctors-task-definition" -> "aidoctors-app-task-definition"%0A        }%0A      ~ tags_all                 = {%0A          ~ "Name" = "aidoctors-task-definition" -> "aidoctors-app-task-definition"%0A        }%0A        # (12 unchanged attributes hidden)%0A    }%0A%0A  # aws_ecs_task_definition.pipeline will be created%0A  + resource "aws_ecs_task_definition" "pipeline" {%0A      + arn                      = (known after apply)%0A      + arn_without_revision     = (known after apply)%0A      + container_definitions    = (known after apply)%0A      + cpu                      = "512"%0A      + enable_fault_injection   = (known after apply)%0A      + execution_role_arn       = "arn:aws:iam::521538197756:role/aidoctors-ecs-task-execution-role"%0A      + family                   = "aidoctors-pipeline"%0A      + id                       = (known after apply)%0A      + memory                   = "1024"%0A      + network_mode             = "awsvpc"%0A      + region                   = "us-east-2"%0A      + requires_compatibilities = [%0A          + "FARGATE",%0A        ]%0A      + revision                 = (known after apply)%0A      + skip_destroy             = false%0A      + tags                     = {%0A          + "Name" = "aidoctors-pipeline-task-definition"%0A        }%0A      + tags_all                 = {%0A          + "Name" = "aidoctors-pipeline-task-definition"%0A        }%0A      + task_role_arn            = "arn:aws:iam::521538197756:role/aidoctors-ecs-task-role"%0A      + track_latest             = false%0A    }%0A%0A  # module.alb.data.aws_partition.current[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_partition" "current" {%0A      + dns_suffix         = (known after apply)%0A      + id                 = (known after apply)%0A      + partition          = (known after apply)%0A      + reverse_dns_prefix = (known after apply)%0A    }%0A%0A  # module.alb.aws_lb.this[0] will be updated in-place%0A  ~ resource "aws_lb" "this" {%0A        id                                                           = "arn:aws:elasticloadbalancing:us-east-2:521538197756:loadbalancer/app/aidoctors-alb/6652fc2ac194375a"%0A        name                                                         = "aidoctors-alb"%0A      ~ subnets                                                      = [%0A          - "subnet-00181454359ad7fee",%0A          - "subnet-07bf335ed55e1233f",%0A        ] -> (known after apply)%0A        tags                                                         = {%0A            "Name"                  = "aidoctors-alb"%0A            "terraform-aws-modules" = "alb"%0A        }%0A        # (27 unchanged attributes hidden)%0A%0A      ~ subnet_mapping (known after apply)%0A      - subnet_mapping {%0A          - subnet_id            = "subnet-00181454359ad7fee" -> null%0A            # (4 unchanged attributes hidden)%0A        }%0A      - subnet_mapping {%0A          - subnet_id            = "subnet-07bf335ed55e1233f" -> null%0A            # (4 unchanged attributes hidden)%0A        }%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # module.ecr.aws_ecr_lifecycle_policy.this[0] will be destroyed%0A  # (because aws_ecr_lifecycle_policy.this is not in configuration)%0A  - resource "aws_ecr_lifecycle_policy" "this" {%0A      - id          = "aidoctors-app" -> null%0A      - policy      = jsonencode(%0A            {%0A              - rules = [%0A                  - {%0A                      - action       = {%0A                          - type = "expire"%0A                        }%0A                      - description  = "Keep last 5 images"%0A                      - rulePriority = 1%0A                      - selection    = {%0A                          - countNumber   = 5%0A                          - countType     = "imageCountMoreThan"%0A                          - tagPrefixList = [%0A                              - "v",%0A                            ]%0A                          - tagStatus     = "tagged"%0A                        }%0A                    },%0A                  - {%0A                      - action       = {%0A                          - type = "expire"%0A                        }%0A                      - description  = "Remove untagged images after 7 days"%0A                      - rulePriority = 2%0A                      - selection    = {%0A                          - countNumber = 7%0A                          - countType   = "sinceImagePushed"%0A                          - countUnit   = "days"%0A                          - tagStatus   = "untagged"%0A                        }%0A                    },%0A                ]%0A            }%0A        ) -> null%0A      - region      = "us-east-2" -> null%0A      - registry_id = "521538197756" -> null%0A      - repository  = "aidoctors-app" -> null%0A    }%0A%0A  # module.ecr.aws_ecr_repository.this[0] will be destroyed%0A  # (because aws_ecr_repository.this is not in configuration)%0A  - resource "aws_ecr_repository" "this" {%0A      - arn                  = "arn:aws:ecr:us-east-2:521538197756:repository/aidoctors-app" -> null%0A      - force_delete         = true -> null%0A      - id                   = "aidoctors-app" -> null%0A      - image_tag_mutability = "IMMUTABLE" -> null%0A      - name                 = "aidoctors-app" -> null%0A      - region               = "us-east-2" -> null%0A      - registry_id          = "521538197756" -> null%0A      - repository_url       = "521538197756.dkr.ecr.us-east-2.amazonaws.com/aidoctors-app" -> null%0A      - tags                 = {%0A          - "Name" = "aidoctors-ecr"%0A        } -> null%0A      - tags_all             = {%0A          - "Name" = "aidoctors-ecr"%0A        } -> null%0A%0A      - encryption_configuration {%0A          - encryption_type = "AES256" -> null%0A            # (1 unchanged attribute hidden)%0A        }%0A%0A      - image_scanning_configuration {%0A          - scan_on_push = true -> null%0A        }%0A    }%0A%0A  # module.ecr.aws_ecr_repository_policy.this[0] will be destroyed%0A  # (because aws_ecr_repository_policy.this is not in configuration)%0A  - resource "aws_ecr_repository_policy" "this" {%0A      - id          = "aidoctors-app" -> null%0A      - policy      = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action    = [%0A                          - "ecr:ListTagsForResource",%0A                          - "ecr:ListImages",%0A                          - "ecr:GetRepositoryPolicy",%0A                          - "ecr:GetLifecyclePolicyPreview",%0A                          - "ecr:GetLifecyclePolicy",%0A                          - "ecr:GetDownloadUrlForLayer",%0A                          - "ecr:GetAuthorizationToken",%0A                          - "ecr:DescribeRepositories",%0A                          - "ecr:DescribeImages",%0A                          - "ecr:DescribeImageScanFindings",%0A                          - "ecr:BatchGetImage",%0A                          - "ecr:BatchCheckLayerAvailability",%0A                        ]%0A                      - Effect    = "Allow"%0A                      - Principal = {%0A                          - AWS = "arn:aws:iam::521538197756:root"%0A                        }%0A                      - Sid       = "PrivateReadOnly"%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> null%0A      - region      = "us-east-2" -> null%0A      - registry_id = "521538197756" -> null%0A      - repository  = "aidoctors-app" -> null%0A    }%0A%0A  # module.ecr_app.aws_ecr_lifecycle_policy.this[0] will be created%0A  + resource "aws_ecr_lifecycle_policy" "this" {%0A      + id          = (known after apply)%0A      + policy      = jsonencode(%0A            {%0A              + rules = [%0A                  + {%0A                      + action       = {%0A                          + type = "expire"%0A                        }%0A                      + description  = "Keep last 5 images"%0A                      + rulePriority = 1%0A                      + selection    = {%0A                          + countNumber   = 5%0A                          + countType     = "imageCountMoreThan"%0A                          + tagPrefixList = [%0A                              + "v",%0A                            ]%0A                          + tagStatus     = "tagged"%0A                        }%0A                    },%0A                  + {%0A                      + action       = {%0A                          + type = "expire"%0A                        }%0A                      + description  = "Remove untagged images after 7 days"%0A                      + rulePriority = 2%0A                      + selection    = {%0A                          + countNumber = 7%0A                          + countType   = "sinceImagePushed"%0A                          + countUnit   = "days"%0A                          + tagStatus   = "untagged"%0A                        }%0A                    },%0A                ]%0A            }%0A        )%0A      + region      = "us-east-2"%0A      + registry_id = (known after apply)%0A      + repository  = "aidoctors-app"%0A    }%0A%0A  # module.ecr_app.aws_ecr_repository.this[0] will be created%0A  + resource "aws_ecr_repository" "this" {%0A      + arn                  = (known after apply)%0A      + force_delete         = true%0A      + id                   = (known after apply)%0A      + image_tag_mutability = "IMMUTABLE"%0A      + name                 = "aidoctors-app"%0A      + region               = "us-east-2"%0A      + registry_id          = (known after apply)%0A      + repository_url       = (known after apply)%0A      + tags                 = {%0A          + "Name" = "aidoctors-app-ecr"%0A        }%0A      + tags_all             = {%0A          + "Name" = "aidoctors-app-ecr"%0A        }%0A%0A      + encryption_configuration {%0A          + encryption_type = "AES256"%0A          + kms_key         = (known after apply)%0A        }%0A%0A      + image_scanning_configuration {%0A          + scan_on_push = true%0A        }%0A    }%0A%0A  # module.ecr_app.aws_ecr_repository_policy.this[0] will be created%0A  + resource "aws_ecr_repository_policy" "this" {%0A      + id          = (known after apply)%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = [%0A                          + "ecr:ListTagsForResource",%0A                          + "ecr:ListImages",%0A                          + "ecr:GetRepositoryPolicy",%0A                          + "ecr:GetLifecyclePolicyPreview",%0A                          + "ecr:GetLifecyclePolicy",%0A                          + "ecr:GetDownloadUrlForLayer",%0A                          + "ecr:GetAuthorizationToken",%0A                          + "ecr:DescribeRepositories",%0A                          + "ecr:DescribeImages",%0A                          + "ecr:DescribeImageScanFindings",%0A                          + "ecr:BatchGetImage",%0A                          + "ecr:BatchCheckLayerAvailability",%0A                        ]%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + AWS = "arn:aws:iam::521538197756:root"%0A                        }%0A                      + Sid       = "PrivateReadOnly"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + region      = "us-east-2"%0A      + registry_id = (known after apply)%0A      + repository  = "aidoctors-app"%0A    }%0A%0A  # module.ecr_pipeline.aws_ecr_lifecycle_policy.this[0] will be created%0A  + resource "aws_ecr_lifecycle_policy" "this" {%0A      + id          = (known after apply)%0A      + policy      = jsonencode(%0A            {%0A              + rules = [%0A                  + {%0A                      + action       = {%0A                          + type = "expire"%0A                        }%0A                      + description  = "Keep last 5 images"%0A                      + rulePriority = 1%0A                      + selection    = {%0A                          + countNumber   = 5%0A                          + countType     = "imageCountMoreThan"%0A                          + tagPrefixList = [%0A                              + "v",%0A                            ]%0A                          + tagStatus     = "tagged"%0A                        }%0A                    },%0A                  + {%0A                      + action       = {%0A                          + type = "expire"%0A                        }%0A                      + description  = "Remove untagged images after 7 days"%0A                      + rulePriority = 2%0A                      + selection    = {%0A                          + countNumber = 7%0A                          + countType   = "sinceImagePushed"%0A                          + countUnit   = "days"%0A                          + tagStatus   = "untagged"%0A                        }%0A                    },%0A                ]%0A            }%0A        )%0A      + region      = "us-east-2"%0A      + registry_id = (known after apply)%0A      + repository  = "aidoctors-pipeline"%0A    }%0A%0A  # module.ecr_pipeline.aws_ecr_repository.this[0] will be created%0A  + resource "aws_ecr_repository" "this" {%0A      + arn                  = (known after apply)%0A      + force_delete         = true%0A      + id                   = (known after apply)%0A      + image_tag_mutability = "IMMUTABLE"%0A      + name                 = "aidoctors-pipeline"%0A      + region               = "us-east-2"%0A      + registry_id          = (known after apply)%0A      + repository_url       = (known after apply)%0A      + tags                 = {%0A          + "Name" = "aidoctors-pipeline-ecr"%0A        }%0A      + tags_all             = {%0A          + "Name" = "aidoctors-pipeline-ecr"%0A        }%0A%0A      + encryption_configuration {%0A          + encryption_type = "AES256"%0A          + kms_key         = (known after apply)%0A        }%0A%0A      + image_scanning_configuration {%0A          + scan_on_push = true%0A        }%0A    }%0A%0A  # module.ecr_pipeline.aws_ecr_repository_policy.this[0] will be created%0A  + resource "aws_ecr_repository_policy" "this" {%0A      + id          = (known after apply)%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = [%0A                          + "ecr:ListTagsForResource",%0A                          + "ecr:ListImages",%0A                          + "ecr:GetRepositoryPolicy",%0A                          + "ecr:GetLifecyclePolicyPreview",%0A                          + "ecr:GetLifecyclePolicy",%0A                          + "ecr:GetDownloadUrlForLayer",%0A                          + "ecr:GetAuthorizationToken",%0A                          + "ecr:DescribeRepositories",%0A                          + "ecr:DescribeImages",%0A                          + "ecr:DescribeImageScanFindings",%0A                          + "ecr:BatchGetImage",%0A                          + "ecr:BatchCheckLayerAvailability",%0A                        ]%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + AWS = "arn:aws:iam::521538197756:root"%0A                        }%0A                      + Sid       = "PrivateReadOnly"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + region      = "us-east-2"%0A      + registry_id = (known after apply)%0A      + repository  = "aidoctors-pipeline"%0A    }%0A%0A  # module.vpc.aws_nat_gateway.this[1] must be replaced%0A+/- resource "aws_nat_gateway" "this" {%0A      ~ association_id                     = "eipassoc-03c8f3b28f269f523" -> (known after apply)%0A      ~ id                                 = "nat-060795adfd71d2087" -> (known after apply)%0A      ~ network_interface_id               = "eni-0dbd126d96cce631f" -> (known after apply)%0A      ~ private_ip                         = "10.0.4.145" -> (known after apply)%0A      ~ public_ip                          = "3.147.233.242" -> (known after apply)%0A      ~ secondary_allocation_ids           = [] -> (known after apply)%0A      ~ secondary_private_ip_address_count = 0 -> (known after apply)%0A      ~ secondary_private_ip_addresses     = [] -> (known after apply)%0A      ~ subnet_id                          = "subnet-00181454359ad7fee" -> (known after apply) # forces replacement%0A        tags                               = {%0A            "Name" = "aidoctors-vpc"%0A        }%0A        # (4 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_route.private_nat_gateway[1] will be updated in-place%0A  ~ resource "aws_route" "private_nat_gateway" {%0A        id                          = "r-rtb-09431dd1309dfe33a1080289494"%0A      ~ nat_gateway_id              = "nat-060795adfd71d2087" -> (known after apply)%0A        # (18 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.vpc.aws_route_table_association.private[1] must be replaced%0A+/- resource "aws_route_table_association" "private" {%0A      ~ id             = "rtbassoc-060bb021411c4af84" -> (known after apply)%0A      ~ subnet_id      = "subnet-0c5b5757a4ad55762" -> (known after apply) # forces replacement%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_route_table_association.public[1] must be replaced%0A+/- resource "aws_route_table_association" "public" {%0A      ~ id             = "rtbassoc-08ce7f62a5a36df2c" -> (known after apply)%0A      ~ subnet_id      = "subnet-00181454359ad7fee" -> (known after apply) # forces replacement%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_subnet.private[1] must be replaced%0A+/- resource "aws_subnet" "private" {%0A      ~ arn                                            = "arn:aws:ec2:us-east-2:521538197756:subnet/subnet-0c5b5757a4ad55762" -> (known after apply)%0A      ~ availability_zone_id                           = "use2-az2" -> (known after apply)%0A      ~ cidr_block                                     = "10.0.5.0/24" -> "10.0.4.0/24" # forces replacement%0A      - enable_lni_at_device_index                     = 0 -> null%0A      ~ id                                             = "subnet-0c5b5757a4ad55762" -> (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      - map_customer_owned_ip_on_launch                = false -> null%0A      ~ owner_id                                       = "521538197756" -> (known after apply)%0A      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)%0A        tags                                           = {%0A            "Name" = "aidoctors-vpc"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_subnet.public[1] must be replaced%0A+/- resource "aws_subnet" "public" {%0A      ~ arn                                            = "arn:aws:ec2:us-east-2:521538197756:subnet/subnet-00181454359ad7fee" -> (known after apply)%0A      ~ availability_zone_id                           = "use2-az2" -> (known after apply)%0A      ~ cidr_block                                     = "10.0.4.0/24" -> "10.0.5.0/24" # forces replacement%0A      - enable_lni_at_device_index                     = 0 -> null%0A      ~ id                                             = "subnet-00181454359ad7fee" -> (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      - map_customer_owned_ip_on_launch                = false -> null%0A      ~ owner_id                                       = "521538197756" -> (known after apply)%0A      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)%0A        tags                                           = {%0A            "Name" = "aidoctors-vpc"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_iam_policy_document" "enhanced_monitoring" {%0A      + id            = (known after apply)%0A      + json          = (known after apply)%0A      + minified_json = (known after apply)%0A%0A      + statement {%0A          + actions = [%0A              + "sts:AssumeRole",%0A            ]%0A%0A          + principals {%0A              + identifiers = [%0A                  + "monitoring.rds.amazonaws.com",%0A                ]%0A              + type        = "Service"%0A            }%0A        }%0A    }%0A%0A  # module.db.module.db_instance.data.aws_partition.current will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_partition" "current" {%0A      + dns_suffix         = (known after apply)%0A      + id                 = (known after apply)%0A      + partition          = (known after apply)%0A      + reverse_dns_prefix = (known after apply)%0A    }%0A%0A  # module.db.module.db_instance.aws_iam_role.enhanced_monitoring[0] will be updated in-place%0A  ~ resource "aws_iam_role" "enhanced_monitoring" {%0A      ~ assume_role_policy    = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action    = "sts:AssumeRole"%0A                      - Effect    = "Allow"%0A                      - Principal = {%0A                          - Service = "monitoring.rds.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> (known after apply)%0A        id                    = "aidoctors-rds-monitoring-role"%0A        name                  = "aidoctors-rds-monitoring-role"%0A        tags                  = {%0A            "Name" = "aidoctors-postgres"%0A        }%0A        # (11 unchanged attributes hidden)%0A    }%0A%0A  # module.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0] must be replaced%0A-/+ resource "aws_iam_role_policy_attachment" "enhanced_monitoring" {%0A      ~ id         = "aidoctors-rds-monitoring-role/arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole" -> (known after apply)%0A      ~ policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole" -> (known after apply) # forces replacement%0A        # (1 unchanged attribute hidden)%0A    }%0A%0APlan: 18 to add, 3 to change, 12 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tfplan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tfplan"%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Pusher: @TerryTian21, Action: `pull_request`, Workflow: `Terraform PR Check`*